# zshrc の前にログイン時に実行されるコマンド

# ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
# ブラウザ
# ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

if [[ "$OSTYPE" == darwin* ]]; then
  export BROWSER='open'
elif [[ "$OSTYPE" == linux* ]]; then
  export BROWSER='xdg-open'
fi

# ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
# エディタ
# ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

export EDITOR='nano'
export VISUAL='nano'
export PAGER='less'

# ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
# 言語設定
# ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

if [[ -z "$LANG" ]]; then
  export LANG='en_US.UTF-8'
fi

# ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
# パス設定
# ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

# パス配列に重複が含まれないようにする
typeset -gU cdpath fpath mailpath path

# Zsh がプログラムを検索するディレクトリのリストを設定
path=(
  /usr/local/{bin,sbin}
  $path
)

# ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
# less の設定
# ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

# デフォルトの Less オプションを設定
# -X (画面クリアの無効化) によりマウスホイールスクロールが無効化されています
# 有効にするには -X と -F (内容が1画面に収まる場合は終了) を削除してください
export LESS='-F -g -i -M -R -S -w -X -z-4'

# Less の入力プリプロセッサを設定
# システムに `lesspipe` または `lesspipe.sh` のいずれかが存在する可能性があるため両方を試す
if (( $#commands[(i)lesspipe(|.sh)] )); then
  export LESSOPEN="| /usr/bin/env $commands[(i)lesspipe(|.sh)] %s 2>&-"
fi

# ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
# lsの設定
# ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

# カラー設定
if [[ "$OSTYPE" == darwin* ]]; then
  export LSCOLORS=ExxxxxxxCxxxxxxxxxxxxx
else
  export LS_COLORS='di=34:ln=35:so=32:pi=33:ex=31:bd=34;46:cd=34;43:su=30;41:sg=30;46:tw=30;42:ow=30;43'
fi
